In [30]:
!pip install ast

Collecting ast
  Downloading AST-0.0.2.tar.gz (19 kB)
WARNING: Discarding https://files.pythonhosted.org/packages/4b/fb/2b954d2a38c9a0ef1da6a46737a75b4dbf6f60e5dad0f267a4ec5ece20de/AST-0.0.2.tar.gz#sha256=dc5b79c6ba11aea72c59c791a0bc5ae483b4c18fec6f643002d6fae24361eba0 (from https://pypi.org/simple/ast/). Command errored out with exit status 1: python setup.py egg_info Check the logs for full command output.
  Downloading AST-0.0.1.tar.gz (19 kB)
WARNING: Discarding https://files.pythonhosted.org/packages/a8/5a/5497b01657ead33200c98009cb9e78fe5986c90cc39ddaa64306f37472cf/AST-0.0.1.tar.gz#sha256=3ed8a7bd3526cfc46de1b849d92b03ae4600ed2042151f187b756c50ade5c2b0 (from https://pypi.org/simple/ast/). Command errored out with exit status 1: python setup.py egg_info Check the logs for full command output.
ERROR: Could not find a version that satisfies the requirement ast (from versions: 0.0.1, 0.0.2)
ERROR: No matching distribution found for ast

In [29]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [244]:
import pandas as pd
import numpy as np
import ast
from sklearn.preprocessing import MultiLabelBinarizer



---

# Importing the datasets

---

In [278]:
df_links_small = pd.read_csv('/content/drive/MyDrive/DataSets/the-movies-dataset/links_small.csv')

In [279]:
df_keywords = pd.read_csv('/content/drive/MyDrive/DataSets/the-movies-dataset/keywords.csv')

In [280]:
df_credits = pd.read_csv('/content/drive/MyDrive/DataSets/the-movies-dataset/credits.csv')

In [281]:
df_movies_metadata_fixed = pd.read_csv('/content/drive/MyDrive/DataSets/the-movies-dataset/movies_metadata_fixed.csv')

In [282]:
display(df_links_small.head())

display(df_links_small.shape)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

(9125, 3)

In [283]:
display(df_keywords.head())

display(df_keywords.shape)

      id                                           keywords
0    862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1   8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2  15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3  31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4  11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

(46419, 2)

In [284]:
display(df_credits.head())

display(df_credits.shape)

                                                cast  ...     id
0  [{'cast_id': 14, 'character': 'Woody (voice)',...  ...    862
1  [{'cast_id': 1, 'character': 'Alan Parrish', '...  ...   8844
2  [{'cast_id': 2, 'character': 'Max Goldman', 'c...  ...  15602
3  [{'cast_id': 1, 'character': "Savannah 'Vannah...  ...  31357
4  [{'cast_id': 1, 'character': 'George Banks', '...  ...  11862

[5 rows x 3 columns]

(45476, 3)

In [285]:
display(df_movies_metadata_fixed.head(1))

display(df_movies_metadata_fixed.shape)

   adult  ... vote_count
0  False  ...       5415

[1 rows x 24 columns]

(45463, 24)



---
# Feature selection
---

In [286]:
df_movies_metadata_fixed = df_movies_metadata_fixed[['id', 'title', 'release_date', 'vote_count', 'vote_average', 'genres']]
df_movies_metadata_fixed.head()

      id  ...                                             genres
0    862  ...  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1   8844  ...  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2  15602  ...  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3  31357  ...  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4  11862  ...                     [{'id': 35, 'name': 'Comedy'}]

[5 rows x 6 columns]

In [287]:
df = df_movies_metadata_fixed.merge(df_credits, how='inner', on='id')
df.head(1)

    id  ...                                               crew
0  862  ...  [{'credit_id': '52fe4284c3a36847f8024f49', 'de...

[1 rows x 8 columns]

In [288]:
df = df.merge(df_keywords, how='inner', on='id')
df.head()

      id  ...                                           keywords
0    862  ...  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1   8844  ...  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2  15602  ...  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3  31357  ...  [{'id': 818, 'name': 'based on novel'}, {'id':...
4  11862  ...  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

[5 rows x 9 columns]

In [289]:
df.shape

(46628, 9)



---

# Work with categorical data

---

In [203]:
def handling_json(df, feature, value):
  df[feature] = df[feature].fillna('[]') \
                             .apply(ast.literal_eval) \
                             .apply(lambda x: [i[value] for i in x] if isinstance(x, list) else [])

  df[feature] = [', '.join(i) for i in df[feature]]
  df[feature] = pd.DataFrame(data=map(str.lower, df[feature])) 
  df[feature] = [i.replace(",", "") for i in df[feature]]

  return df

---
## Handling 'genres' column
---

In [290]:
def handling_genres_column_json(df):
  df['genres'] = df['genres'].fillna('[]') \
                             .apply(ast.literal_eval) \
                             .apply(lambda x: [i['name'] for i in x] if isinstance(x, list) else [])

  '''mlb = MultiLabelBinarizer(sparse_output=True)

  df = df.join(pd.DataFrame.sparse.from_spmatrix(
                  mlb.fit_transform(df.pop('genres')),
                  index=df.index,
                  columns=mlb.classes_))'''

  df.genres = [', '.join(i) for i in df.genres]
  df.genres = pd.DataFrame(data=map(str.lower, df.genres)) 
  df.genres = [i.replace(",", "") for i in df.genres]

  return df

In [291]:
df = handling_genres_column_json(df)

In [292]:
df.head()

      id  ...                                           keywords
0    862  ...  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1   8844  ...  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2  15602  ...  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3  31357  ...  [{'id': 818, 'name': 'based on novel'}, {'id':...
4  11862  ...  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

[5 rows x 9 columns]



---

## Handling 'cast' column

---

In [293]:
def handling_cast_column_json(df):
  df['cast'] = df['cast'].fillna('[]') \
                             .apply(ast.literal_eval) \
                             .apply(lambda x: [i['name'] for i in x] if isinstance(x, list) else [])

  df.cast = [', '.join(i) for i in df.cast]
  df.cast = pd.DataFrame(data=map(str.lower, df.cast)) 
  df.cast = [i.replace(" ", "") for i in df['cast']]
  df.cast = [i.replace(",", " ") for i in df['cast']]
  return df

In [294]:
df = handling_cast_column_json(df)

In [242]:
df1.head()

      id  ...                                           keywords
0    862  ...  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1   8844  ...  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2  15602  ...  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3  31357  ...  [{'id': 818, 'name': 'based on novel'}, {'id':...
4  11862  ...  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

[5 rows x 9 columns]



---

## Handling 'crew' column

---

In [273]:
df.crew[0][4]['job']

'Screenplay'

In [274]:
len(df.crew[0])

106

In [ ]:
df['crew'] = df['crew'].fillna('[]') \
                             .apply(ast.literal_eval)

In [297]:
def get_director(df):
  df['crew'] = df['crew'].fillna('[]') \
                             .apply(ast.literal_eval)
  len_of_dataset = df.shape[0]              
  for i in range(len_of_dataset):
    for k in range(len(df.crew[i])):
      if df.crew[i][k]['job'] == 'Director':
        df.crew = df.crew[i][k]['name']
  return np.nan

In [ ]:
df1 = df
get_director(df1)